#include<stdio.h>
int main(void)
{
	float a = 0, c = 0, d = 0;
	a = 7.5;
	c = 5 / 2;//c=2;结果不为2.5，因为当两个运算对象有一个为浮点型时，结果才是浮点型，此时5与2均是整数非浮点型
	d = 5.0 / 2.0;//将5或者2其中任意一个改为5.0或2.0，即可将输出结果改变为2.5
	printf("%f,%f,%f\n\n", a,c,d);//用%f输出小数

	int e = 10, f = 3, g = 0;
	g = e % f;//%为求余，求余运算符的两个对象必须都是整数（c语言特色）
	printf("%d\n", g);
	printf("%d\n", 15 % 6);//3
	printf("%d\n", 15 % -6);//3
	printf("%d\n", -15 % 6);//-3
	printf("%d\n", -15 % -6);//-3
	printf("%d\n\n", 6 % 15);//6
	//结论：余数的正负与被除数的正负有关

	int h = 0;
	h = 20;
	h++;//相当于 h=h+1=21;相当于已经做了一次运算将h赋值为了21
	printf("%d\n", h++);//21
	//相当于以下的两条语句(先读后写)(先读出此时的h，再进行++操作)(++后缀)
	//printf("%d\n",a);//21
	//a=a+1;//a=22
	printf("%d\n\n", h);//22

	int i = 0;
	i = 20;
	++i;//相当于i=i+1=21;相当于已经做了一次运算将i赋值为了21
	printf("%d\n", ++i);//22
	//相当于以下的两条语句(先写后读)(已经做出了赋值+1的操作)
	//i=i+1;//i=22;
	//printf("%d\n",i);//22
	printf("%d\n", i);//22
	return 0;
}